{
  "backend/main.mo": "Motoko backend managing user profiles and day logs with access control, providing CRUD-style methods for profiles and daily study/exercise entries.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and test IDs with confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their purpose, behavior, and UI roles.",
  "frontend/index.css": "Tailwind base styles defining theme color variables for light and dark mode using OKLCH values.",
  "frontend/index.html": "HTML entry point loading the React app with favicon and root mount element.",
  "frontend/src/App.tsx": "Main app component handling authentication gating, routing, layout, theming, and profile setup flow.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Public landing screen showing mascot, app intro, and login button when the user is unauthenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading state, error handling, and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog prompting new users to enter their name and save their profile through the backend actor.",
  "frontend/src/components/daylog/ExerciseItemEditor.tsx": "Form component for creating or editing an exercise item with description and reps, then saving or canceling.",
  "frontend/src/components/daylog/ExerciseSection.tsx": "Displays exercise items with add, edit, delete, and completion toggle functionality, saving updates via mutation.",
  "frontend/src/components/daylog/StudyItemEditor.tsx": "Form for creating or editing a study item with title and notes, supporting save and cancel actions.",
  "frontend/src/components/daylog/StudySection.tsx": "Shows study items with add, edit, delete, and completion toggle features, persisting changes through a save mutation.",
  "frontend/src/components/insights/InsightsPanel.tsx": "Computes and displays streaks and weekly completion stats for study and exercise activity.",
  "frontend/src/components/layout/AppHeader.tsx": "App header with navigation, logo, and login/profile display that highlights the active route.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on authentication state and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current user’s profile using the actor and exposes loading state.",
  "frontend/src/hooks/useDayLogs.ts": "Provides hooks to fetch all day logs and to save a day log with cache invalidation and toast feedback.",
  "frontend/src/hooks/useInsights.ts": "Fetches completion statistics for study and exercise items using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity state and login/logout helpers.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light/dark themes, plus utility component classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Loads today's day log data and renders study, exercise, and insights sections with loading and error states.",
  "frontend/src/pages/HistoryPage.tsx": "Displays past day logs, allows selecting a log, and supports copying unfinished items into today's log.",
  "frontend/src/utils/copyUnfinished.ts": "Merges unfinished study and exercise items into a current log while avoiding duplicates and resetting completion.",
  "frontend/src/utils/dates.ts": "Provides date helpers for formatting timestamps and determining daily keys and whether a timestamp is today.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling custom color palettes, animations, container settings, and plugins.",
  "project_state.json": "Defines the project’s current state, including features, pending requests, and image requirements for a student study and exercise tracker. Contains metadata, existing feature list, and new feature requests awaiting implementation."
}